{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "RecommenderNet", "config": {"name": "recommender_net", "trainable": true, "dtype": "float32"}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"name": "binary_crossentropy", "reduction": "sum_over_batch_size", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "loss_weights": null, "metrics": [{"class_name": "RootMeanSquaredError", "config": {"name": "root_mean_squared_error", "dtype": "float32"}}], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.00039999998989515007, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "recommender_net/embedding/embeddings", "shape": [300, 50], "dtype": "float32"}, {"name": "recommender_net/embedding_1/embeddings", "shape": [300, 1], "dtype": "float32"}, {"name": "recommender_net/embedding_2/embeddings", "shape": [437, 50], "dtype": "float32"}, {"name": "recommender_net/embedding_3/embeddings", "shape": [437, 1], "dtype": "float32"}]}]}