{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "437"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "437"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "64"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice_2"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice_3"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/Less", "StatefulPartitionedCall/recommender_net_1/embedding_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/add", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_1/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2", "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2", "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape", "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/MatMul", "StatefulPartitionedCall/recommender_net_1/Tensordot/shape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/recommender_net_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/recommender_net_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/ReadVariableOp", "shape": [300, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/ReadVariableOp", "shape": [437, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/shape_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/ReadVariableOp", "shape": [300, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/ReadVariableOp", "shape": [437, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/axis", "shape": [], "dtype": "int32"}]}]}